Ran Plan for 4 projects:

1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
1. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
1. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
1. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`

### 1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_address.asg[0] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "us-west4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_address.asg[1] will be created
+ resource "google_compute_address" "asg" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "us-east4"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_autoscaler.asg[0] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "asg-amer-us-west4"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "us-west4-b"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 2
          + min_replicas    = 2
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.5
            }
        }
    }

  # google_compute_autoscaler.asg[1] will be created
+ resource "google_compute_autoscaler" "asg" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "asg-amer-us-east4"
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target             = (known after apply)
      + zone               = "us-east4-b"

      + autoscaling_policy {
          + cooldown_period = 60
          + max_replicas    = 2
          + min_replicas    = 2
          + mode            = "ON"

          + cpu_utilization {
              + target = 0.5
            }
        }
    }

  # google_compute_forwarding_rule.asg[0] will be created
+ resource "google_compute_forwarding_rule" "asg" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + ip_version            = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "asg-forwarding-rule-us-west4"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = (known after apply)
      + region                = "us-west4"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_forwarding_rule.asg[1] will be created
+ resource "google_compute_forwarding_rule" "asg" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + ip_version            = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "asg-forwarding-rule-us-east4"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = (known after apply)
      + region                = "us-east4"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_http_health_check.asg[1] will be created
+ resource "google_compute_http_health_check" "asg" {
      + check_interval_sec  = 30
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "asg-health-check-us-east4"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/"
      + self_link           = (known after apply)
      + timeout_sec         = 3
      + unhealthy_threshold = 2
    }

  # google_compute_instance_group_manager.asg[0] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "frontend-asg-amer-us-west40"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "asg-group-manager-amer-us-west4"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "us-west4-b"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = (known after apply)
        }
    }

  # google_compute_instance_group_manager.asg[1] will be created
+ resource "google_compute_instance_group_manager" "asg" {
      + base_instance_name = "frontend-asg-amer-us-east41"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + instance_group     = (known after apply)
      + instance_template  = (known after apply)
      + name               = "asg-group-manager-amer-us-east4"
      + operation          = (known after apply)
      + project            = (known after apply)
      + self_link          = (known after apply)
      + target_pools       = (known after apply)
      + target_size        = (known after apply)
      + update_strategy    = (known after apply)
      + wait_for_instances = false
      + zone               = "us-east4-b"

      + update_policy {
          + max_surge_fixed         = (known after apply)
          + max_surge_percent       = (known after apply)
          + max_unavailable_fixed   = (known after apply)
          + max_unavailable_percent = (known after apply)
          + min_ready_sec           = (known after apply)
          + minimal_action          = (known after apply)
          + type                    = (known after apply)
        }

      + version {
          + instance_template = (known after apply)
        }
    }

  # google_compute_instance_template.asg will be created
+ resource "google_compute_instance_template" "asg" {
      + can_ip_forward          = false
      + id                      = (known after apply)
      + machine_type            = "f1-micro"
      + metadata                = {
          + "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<~EOT
            sudo apt-get update
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
            server = puppet
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
            echo "35.233.219.1 puppet" >> /etc/hosts
        EOT
      + name                    = (known after apply)
      + name_prefix             = (known after apply)
      + project                 = (known after apply)
      + region                  = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)

      + disk {
          + auto_delete  = true
          + boot         = (known after apply)
          + device_name  = (known after apply)
          + disk_type    = (known after apply)
          + interface    = (known after apply)
          + mode         = (known after apply)
          + source_image = "debian-cloud/debian-9"
          + type         = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_target_pool.asg[0] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "asg-health-check-us-west4",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "asg-target-pool-us-west4"
      + project          = (known after apply)
      + region           = "us-west4"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_compute_target_pool.asg[1] will be created
+ resource "google_compute_target_pool" "asg" {
      + health_checks    = [
          + "asg-health-check-us-east4",
        ]
      + id               = (known after apply)
      + instances        = (known after apply)
      + name             = "asg-target-pool-us-east4"
      + project          = (known after apply)
      + region           = "us-east4"
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # google_dns_record_set.asg[0] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "frontend-asg.us-west4.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.asg[1] will be created
+ resource "google_dns_record_set" "asg" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "frontend-asg.us-east4.dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.asg_main[0] will be created
+ resource "google_dns_record_set" "asg_main" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.asg_main[1] will be created
+ resource "google_dns_record_set" "asg_main" {
      + id           = (known after apply)
      + managed_zone = "dmlc"
      + name         = "dmlc.pw."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # random_id.instance_id will be created
+ resource "random_id" "instance_id" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 55, in resource "google_dns_record_set" "asg_main":
  55:   name = "${var.dns_domain}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_amer_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_amer_autoscale`
</details>

---
### 2. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_address.asg[0] will be destroyed
- resource "google_compute_address" "asg" {
      - address            = "35.241.109.79" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2020-09-22T14:29:30.636-07:00" -> null
      - id                 = "projects/2036174436/regions/asia-east2/addresses/dmlc-autoscale-44b4fdf59a81141f" -> null
      - name               = "dmlc-autoscale-44b4fdf59a81141f" -> null
      - network_tier       = "PREMIUM" -> null
      - project            = "2036174436" -> null
      - region             = "asia-east2" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/asia-east2/addresses/dmlc-autoscale-44b4fdf59a81141f" -> null
      - users              = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/asia-east2/forwardingRules/asg-forwarding-rule-asia-east2",
        ] -> null
    }

  # google_compute_autoscaler.asg[0] will be destroyed
- resource "google_compute_autoscaler" "asg" {
      - creation_timestamp = "2020-09-22T14:30:10.152-07:00" -> null
      - id                 = "projects/2036174436/zones/asia-east2-b/autoscalers/asg-asia-asia-east2" -> null
      - name               = "asg-asia-asia-east2" -> null
      - project            = "2036174436" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/asia-east2-b/autoscalers/asg-asia-asia-east2" -> null
      - target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/asia-east2-b/instanceGroupManagers/asg-group-manager-asia-asia-east2" -> null
      - zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/asia-east2-b" -> null

      - autoscaling_policy {
          - cooldown_period = 60 -> null
          - max_replicas    = 2 -> null
          - min_replicas    = 2 -> null
          - mode            = "ON" -> null

          - cpu_utilization {
              - target = 0.5 -> null
            }
        }
    }

  # google_compute_forwarding_rule.asg[0] will be destroyed
- resource "google_compute_forwarding_rule" "asg" {
      - all_ports             = false -> null
      - allow_global_access   = false -> null
      - creation_timestamp    = "2020-09-22T14:29:53.881-07:00" -> null
      - id                    = "projects/2036174436/regions/asia-east2/forwardingRules/asg-forwarding-rule-asia-east2" -> null
      - ip_address            = "35.241.109.79" -> null
      - ip_protocol           = "TCP" -> null
      - load_balancing_scheme = "EXTERNAL" -> null
      - name                  = "asg-forwarding-rule-asia-east2" -> null
      - network_tier          = "PREMIUM" -> null
      - port_range            = "80-80" -> null
      - ports                 = [] -> null
      - project               = "2036174436" -> null
      - region                = "asia-east2" -> null
      - self_link             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/asia-east2/forwardingRules/asg-forwarding-rule-asia-east2" -> null
      - target                = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/asia-east2/targetPools/asg-target-pool-asia-east2" -> null
    }

  # google_compute_http_health_check.asg[0] will be destroyed
- resource "google_compute_http_health_check" "asg" {
      - check_interval_sec  = 30 -> null
      - creation_timestamp  = "2020-09-22T14:29:30.634-07:00" -> null
      - healthy_threshold   = 2 -> null
      - id                  = "projects/2036174436/global/httpHealthChecks/asg-health-check-asia-east2" -> null
      - name                = "asg-health-check-asia-east2" -> null
      - port                = 80 -> null
      - project             = "2036174436" -> null
      - request_path        = "/" -> null
      - self_link           = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-asia-east2" -> null
      - timeout_sec         = 3 -> null
      - unhealthy_threshold = 2 -> null
    }

  # google_compute_instance_group_manager.asg[0] will be destroyed
- resource "google_compute_instance_group_manager" "asg" {
      - base_instance_name = "frontend-asg-asia-asia-east20" -> null
      - fingerprint        = "6DCzzHpjyFE=" -> null
      - id                 = "projects/2036174436/zones/asia-east2-b/instanceGroupManagers/asg-group-manager-asia-asia-east2" -> null
      - instance_group     = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/asia-east2-b/instanceGroups/asg-group-manager-asia-asia-east2" -> null
      - name               = "asg-group-manager-asia-asia-east2" -> null
      - project            = "2036174436" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/asia-east2-b/instanceGroupManagers/asg-group-manager-asia-asia-east2" -> null
      - target_pools       = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/asia-east2/targetPools/asg-target-pool-asia-east2",
        ] -> null
      - target_size        = 2 -> null
      - wait_for_instances = false -> null
      - zone               = "asia-east2-b" -> null

      - update_policy {
          - max_surge_fixed         = 1 -> null
          - max_surge_percent       = 0 -> null
          - max_unavailable_fixed   = 1 -> null
          - max_unavailable_percent = 0 -> null
          - min_ready_sec           = 0 -> null
          - minimal_action          = "REPLACE" -> null
          - type                    = "OPPORTUNISTIC" -> null
        }

      - version {
          - instance_template = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200922212941612200000001" -> null
        }
    }

  # google_compute_instance_template.asg must be replaced
-/+ resource "google_compute_instance_template" "asg" {
        can_ip_forward          = false
      ~ id                      = "projects/2036174436/global/instanceTemplates/terraform-20200922212941612200000001" -> (known after apply)
        machine_type            = "f1-micro"
        metadata                = {
            "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      ~ metadata_fingerprint    = "pTtY6EQNmzs=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            sudo apt-get update
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
          - server = seed.dmlc.pw
          + server = puppet
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
          + echo "35.233.219.1 puppet" >> /etc/hosts
        EOT
      ~ name                    = "terraform-20200922212941612200000001" -> (known after apply)
      + name_prefix             = (known after apply)
      ~ project                 = "2036174436" -> (known after apply)
      + region                  = (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200922212941612200000001" -> (known after apply)
      - tags                    = [] -> null
      + tags_fingerprint        = (known after apply)

      ~ disk {
            auto_delete  = true
          ~ boot         = true -> (known after apply)
          ~ device_name  = "persistent-disk-0" -> (known after apply)
          - disk_size_gb = 0 -> null
          ~ disk_type    = "pd-standard" -> (known after apply)
          ~ interface    = "SCSI" -> (known after apply)
          - labels       = {} -> null
          ~ mode         = "READ_WRITE" -> (known after apply)
          ~ source_image = "projects/debian-cloud/global/images/family/debian-9" -> "debian-cloud/debian-9"
          ~ type         = "PERSISTENT" -> (known after apply)
        }

      ~ network_interface {
          + name               = (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/networks/default" -> "default"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_target_pool.asg[0] will be destroyed
- resource "google_compute_target_pool" "asg" {
      - failover_ratio   = 0 -> null
      - health_checks    = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-asia-east2",
        ] -> null
      - id               = "projects/2036174436/regions/asia-east2/targetPools/asg-target-pool-asia-east2" -> null
      - instances        = [
          - "asia-east2-b/frontend-asg-asia-asia-east20-9f50",
          - "asia-east2-b/frontend-asg-asia-asia-east20-vhp3",
        ] -> null
      - name             = "asg-target-pool-asia-east2" -> null
      - project          = "2036174436" -> null
      - region           = "asia-east2" -> null
      - self_link        = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/asia-east2/targetPools/asg-target-pool-asia-east2" -> null
      - session_affinity = "NONE" -> null
    }

  # google_dns_record_set.asg[0] will be destroyed
- resource "google_dns_record_set" "asg" {
      - id           = "dmlc/frontend-asg.asia-east2.dmlc.pw./A" -> null
      - managed_zone = "dmlc" -> null
      - name         = "frontend-asg.asia-east2.dmlc.pw." -> null
      - project      = "2036174436" -> null
      - rrdatas      = [
          - "35.241.109.79",
        ] -> null
      - ttl          = 300 -> null
      - type         = "A" -> null
    }

Plan: 1 to add, 0 to change, 8 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 55, in resource "google_dns_record_set" "asg_main":
  55:   name = "${var.dns_domain}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_asia_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_asia_autoscale`
</details>

---
### 3. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_address.asg[0] will be destroyed
- resource "google_compute_address" "asg" {
      - address            = "35.244.101.202" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2020-09-22T14:19:59.407-07:00" -> null
      - id                 = "projects/2036174436/regions/australia-southeast1/addresses/dmlc-autoscale-ca2b3bd7f7f78b45" -> null
      - name               = "dmlc-autoscale-ca2b3bd7f7f78b45" -> null
      - network_tier       = "PREMIUM" -> null
      - project            = "2036174436" -> null
      - region             = "australia-southeast1" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/australia-southeast1/addresses/dmlc-autoscale-ca2b3bd7f7f78b45" -> null
      - users              = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/australia-southeast1/forwardingRules/asg-forwarding-rule-australia-southeast1",
        ] -> null
    }

  # google_compute_autoscaler.asg[0] will be destroyed
- resource "google_compute_autoscaler" "asg" {
      - creation_timestamp = "2020-09-22T14:20:36.308-07:00" -> null
      - id                 = "projects/2036174436/zones/australia-southeast1-b/autoscalers/asg-ocea-australia-southeast1" -> null
      - name               = "asg-ocea-australia-southeast1" -> null
      - project            = "2036174436" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/australia-southeast1-b/autoscalers/asg-ocea-australia-southeast1" -> null
      - target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/australia-southeast1-b/instanceGroupManagers/asg-group-manager-ocea-australia-southeast1" -> null
      - zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/australia-southeast1-b" -> null

      - autoscaling_policy {
          - cooldown_period = 60 -> null
          - max_replicas    = 2 -> null
          - min_replicas    = 2 -> null
          - mode            = "ON" -> null

          - cpu_utilization {
              - target = 0.5 -> null
            }
        }
    }

  # google_compute_forwarding_rule.asg[0] will be destroyed
- resource "google_compute_forwarding_rule" "asg" {
      - all_ports             = false -> null
      - allow_global_access   = false -> null
      - creation_timestamp    = "2020-09-22T14:20:22.605-07:00" -> null
      - id                    = "projects/2036174436/regions/australia-southeast1/forwardingRules/asg-forwarding-rule-australia-southeast1" -> null
      - ip_address            = "35.244.101.202" -> null
      - ip_protocol           = "TCP" -> null
      - load_balancing_scheme = "EXTERNAL" -> null
      - name                  = "asg-forwarding-rule-australia-southeast1" -> null
      - network_tier          = "PREMIUM" -> null
      - port_range            = "80-80" -> null
      - ports                 = [] -> null
      - project               = "2036174436" -> null
      - region                = "australia-southeast1" -> null
      - self_link             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/australia-southeast1/forwardingRules/asg-forwarding-rule-australia-southeast1" -> null
      - target                = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/australia-southeast1/targetPools/asg-target-pool-australia-southeast1" -> null
    }

  # google_compute_http_health_check.asg[0] will be destroyed
- resource "google_compute_http_health_check" "asg" {
      - check_interval_sec  = 30 -> null
      - creation_timestamp  = "2020-09-22T14:19:59.319-07:00" -> null
      - healthy_threshold   = 2 -> null
      - id                  = "projects/2036174436/global/httpHealthChecks/asg-health-check-australia-southeast1" -> null
      - name                = "asg-health-check-australia-southeast1" -> null
      - port                = 80 -> null
      - project             = "2036174436" -> null
      - request_path        = "/" -> null
      - self_link           = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-australia-southeast1" -> null
      - timeout_sec         = 3 -> null
      - unhealthy_threshold = 2 -> null
    }

  # google_compute_instance_group_manager.asg[0] will be destroyed
- resource "google_compute_instance_group_manager" "asg" {
      - base_instance_name = "frontend-asg-ocea-australia-southeast10" -> null
      - fingerprint        = "AB46szE9p4c=" -> null
      - id                 = "projects/2036174436/zones/australia-southeast1-b/instanceGroupManagers/asg-group-manager-ocea-australia-southeast1" -> null
      - instance_group     = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/australia-southeast1-b/instanceGroups/asg-group-manager-ocea-australia-southeast1" -> null
      - name               = "asg-group-manager-ocea-australia-southeast1" -> null
      - project            = "2036174436" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/australia-southeast1-b/instanceGroupManagers/asg-group-manager-ocea-australia-southeast1" -> null
      - target_pools       = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/australia-southeast1/targetPools/asg-target-pool-australia-southeast1",
        ] -> null
      - target_size        = 2 -> null
      - wait_for_instances = false -> null
      - zone               = "australia-southeast1-b" -> null

      - update_policy {
          - max_surge_fixed         = 1 -> null
          - max_surge_percent       = 0 -> null
          - max_unavailable_fixed   = 1 -> null
          - max_unavailable_percent = 0 -> null
          - min_ready_sec           = 0 -> null
          - minimal_action          = "REPLACE" -> null
          - type                    = "OPPORTUNISTIC" -> null
        }

      - version {
          - instance_template = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200922212010593400000001" -> null
        }
    }

  # google_compute_instance_template.asg must be replaced
-/+ resource "google_compute_instance_template" "asg" {
        can_ip_forward          = false
      ~ id                      = "projects/2036174436/global/instanceTemplates/terraform-20200922212010593400000001" -> (known after apply)
        machine_type            = "f1-micro"
        metadata                = {
            "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      ~ metadata_fingerprint    = "pTtY6EQNmzs=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            sudo apt-get update
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
          - server = seed.dmlc.pw
          + server = puppet
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
          + echo "35.233.219.1 puppet" >> /etc/hosts
        EOT
      ~ name                    = "terraform-20200922212010593400000001" -> (known after apply)
      + name_prefix             = (known after apply)
      ~ project                 = "2036174436" -> (known after apply)
      + region                  = (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200922212010593400000001" -> (known after apply)
      - tags                    = [] -> null
      + tags_fingerprint        = (known after apply)

      ~ disk {
            auto_delete  = true
          ~ boot         = true -> (known after apply)
          ~ device_name  = "persistent-disk-0" -> (known after apply)
          - disk_size_gb = 0 -> null
          ~ disk_type    = "pd-standard" -> (known after apply)
          ~ interface    = "SCSI" -> (known after apply)
          - labels       = {} -> null
          ~ mode         = "READ_WRITE" -> (known after apply)
          ~ source_image = "projects/debian-cloud/global/images/family/debian-9" -> "debian-cloud/debian-9"
          ~ type         = "PERSISTENT" -> (known after apply)
        }

      ~ network_interface {
          + name               = (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/networks/default" -> "default"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_target_pool.asg[0] will be destroyed
- resource "google_compute_target_pool" "asg" {
      - failover_ratio   = 0 -> null
      - health_checks    = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-australia-southeast1",
        ] -> null
      - id               = "projects/2036174436/regions/australia-southeast1/targetPools/asg-target-pool-australia-southeast1" -> null
      - instances        = [
          - "australia-southeast1-b/frontend-asg-ocea-australia-southeast10-240v",
          - "australia-southeast1-b/frontend-asg-ocea-australia-southeast10-mt56",
        ] -> null
      - name             = "asg-target-pool-australia-southeast1" -> null
      - project          = "2036174436" -> null
      - region           = "australia-southeast1" -> null
      - self_link        = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/australia-southeast1/targetPools/asg-target-pool-australia-southeast1" -> null
      - session_affinity = "NONE" -> null
    }

  # google_dns_record_set.asg[0] will be destroyed
- resource "google_dns_record_set" "asg" {
      - id           = "dmlc/frontend-asg.australia-southeast1.dmlc.pw./A" -> null
      - managed_zone = "dmlc" -> null
      - name         = "frontend-asg.australia-southeast1.dmlc.pw." -> null
      - project      = "2036174436" -> null
      - rrdatas      = [
          - "35.244.101.202",
        ] -> null
      - ttl          = 300 -> null
      - type         = "A" -> null
    }

Plan: 1 to add, 0 to change, 8 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 55, in resource "google_dns_record_set" "asg_main":
  55:   name = "${var.dns_domain}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_ocea_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Focea)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_ocea_autoscale`
</details>

---
### 4. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_address.asg[0] will be destroyed
- resource "google_compute_address" "asg" {
      - address            = "34.65.169.148" -> null
      - address_type       = "EXTERNAL" -> null
      - creation_timestamp = "2020-09-22T12:44:38.364-07:00" -> null
      - id                 = "projects/2036174436/regions/europe-west6/addresses/dmlc-autoscale-80899d8bb710c866" -> null
      - name               = "dmlc-autoscale-80899d8bb710c866" -> null
      - network_tier       = "PREMIUM" -> null
      - project            = "2036174436" -> null
      - region             = "europe-west6" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/addresses/dmlc-autoscale-80899d8bb710c866" -> null
      - users              = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/forwardingRules/asg-forwarding-rule-europe-west6",
        ] -> null
    }

  # google_compute_autoscaler.asg[0] will be destroyed
- resource "google_compute_autoscaler" "asg" {
      - creation_timestamp = "2020-09-22T12:45:15.017-07:00" -> null
      - id                 = "projects/2036174436/zones/europe-west6-a/autoscalers/asg-euro-europe-west6" -> null
      - name               = "asg-euro-europe-west6" -> null
      - project            = "2036174436" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a/autoscalers/asg-euro-europe-west6" -> null
      - target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a/instanceGroupManagers/asg-group-manager-euro-europe-west6" -> null
      - zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a" -> null

      - autoscaling_policy {
          - cooldown_period = 60 -> null
          - max_replicas    = 2 -> null
          - min_replicas    = 2 -> null
          - mode            = "ON" -> null

          - cpu_utilization {
              - target = 0.5 -> null
            }
        }
    }

  # google_compute_forwarding_rule.asg[0] will be destroyed
- resource "google_compute_forwarding_rule" "asg" {
      - all_ports             = false -> null
      - allow_global_access   = false -> null
      - creation_timestamp    = "2020-09-22T12:45:01.132-07:00" -> null
      - id                    = "projects/2036174436/regions/europe-west6/forwardingRules/asg-forwarding-rule-europe-west6" -> null
      - ip_address            = "34.65.169.148" -> null
      - ip_protocol           = "TCP" -> null
      - load_balancing_scheme = "EXTERNAL" -> null
      - name                  = "asg-forwarding-rule-europe-west6" -> null
      - network_tier          = "PREMIUM" -> null
      - port_range            = "80-80" -> null
      - ports                 = [] -> null
      - project               = "2036174436" -> null
      - region                = "europe-west6" -> null
      - self_link             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/forwardingRules/asg-forwarding-rule-europe-west6" -> null
      - target                = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/targetPools/asg-target-pool-europe-west6" -> null
    }

  # google_compute_http_health_check.asg[0] will be destroyed
- resource "google_compute_http_health_check" "asg" {
      - check_interval_sec  = 30 -> null
      - creation_timestamp  = "2020-09-22T12:44:38.256-07:00" -> null
      - healthy_threshold   = 2 -> null
      - id                  = "projects/2036174436/global/httpHealthChecks/asg-health-check-europe-west6" -> null
      - name                = "asg-health-check-europe-west6" -> null
      - port                = 80 -> null
      - project             = "2036174436" -> null
      - request_path        = "/" -> null
      - self_link           = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-europe-west6" -> null
      - timeout_sec         = 3 -> null
      - unhealthy_threshold = 2 -> null
    }

  # google_compute_instance_group_manager.asg[0] will be destroyed
- resource "google_compute_instance_group_manager" "asg" {
      - base_instance_name = "frontend-asg-euro-europe-west60" -> null
      - fingerprint        = "2LJXl_hY9G8=" -> null
      - id                 = "projects/2036174436/zones/europe-west6-a/instanceGroupManagers/asg-group-manager-euro-europe-west6" -> null
      - instance_group     = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a/instanceGroups/asg-group-manager-euro-europe-west6" -> null
      - name               = "asg-group-manager-euro-europe-west6" -> null
      - project            = "2036174436" -> null
      - self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/europe-west6-a/instanceGroupManagers/asg-group-manager-euro-europe-west6" -> null
      - target_pools       = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/targetPools/asg-target-pool-europe-west6",
        ] -> null
      - target_size        = 2 -> null
      - wait_for_instances = false -> null
      - zone               = "europe-west6-a" -> null

      - update_policy {
          - max_surge_fixed         = 1 -> null
          - max_surge_percent       = 0 -> null
          - max_unavailable_fixed   = 1 -> null
          - max_unavailable_percent = 0 -> null
          - min_ready_sec           = 0 -> null
          - minimal_action          = "REPLACE" -> null
          - type                    = "OPPORTUNISTIC" -> null
        }

      - version {
          - instance_template = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200922194449451100000001" -> null
        }
    }

  # google_compute_instance_template.asg must be replaced
-/+ resource "google_compute_instance_template" "asg" {
        can_ip_forward          = false
      ~ id                      = "projects/2036174436/global/instanceTemplates/terraform-20200922194449451100000001" -> (known after apply)
        machine_type            = "f1-micro"
        metadata                = {
            "ssh-keys" = <<~EOT
                dmalicia:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQCobuzwfxuNnlZUgmPqHdSLj6+s6giPOfCCfi2UjHpuzMr5/cRS0HxZBem2A0cyNcbPiG+WIsnd+jocrqE+WlaioLZwXWPbQ4OAYeZb0yibfks/jG6GMszyyN1qg2davPogsTPlwFQubnWb1HTZiz2K58OcKETuv3mJLGqZsRsIai/Trvx7TLax5YHnVYTdM8fEfGCiByWjpU2g+cpPHe2qcSWjoMm9ThMW/jZ5Xc68HnSdap4X37SaP29SRN3AqA464efYMgZzEuIe0aHFwA9pkwXCS+NDWZx8VTRSJIkpvLzpjzrLrBFh/w6ECZlwHXI4KcP28B92otcfM+Tot+wzWxEitT22VaRBNrXwwExxqC4IC4ZxL5pxxpydy04GsraShjgcA3hxEh1YJl4BZud3Na9KtdimQ7CPzgKwsHaPTtb1QCWDdCsoDW5PW7Cz4029CruVwP13Mkm8sK0ja59m7uH8lpIi2SVMnOS6YkZfxN7/9IVHgNDnd4OYi2HR84hVTs6578HFhft3jdE6j5TVyQLXK/PLxZJKlXO7EkIGvytjW+1XOeGFywB7l9l2G4aSAN1CBertde4J8vyPwv0SqWW684TuoGj5hxfFU3XoQpFlDbN2QH2fm3oExMxzfFMRTM6cyJa410/w6lZswsWC1Wonf6juVw1P3RSY0uDEcw== root@sandworm
            EOT
        }
      ~ metadata_fingerprint    = "pTtY6EQNmzs=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            sudo apt-get update
            rm -rf /etc/motd
            sudo apt-get install -yq build-essential python-pip rsync software-properties-common apt-transport-https unzip
            curl -fsSL https://download.docker.com/linux/debian/gpg | sudo apt-key add -;
            A=`lsb_release -cs`
            sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/debian $A stable";
            sudo apt-get update
            sudo apt-get -yq install docker-ce docker-ce-cli containerd.io;
            sleep 10
            git clone https://github.com/dmalicia/dm-terraform.git /usr/local/share/dm-terraform/
            wget https://apt.puppetlabs.com/puppetlabs-release-trusty.deb /
            sleep 10
            sudo dpkg -i /puppetlabs-release-trusty.deb
            sudo apt-get update
            sudo apt-get install puppet -yq
            cat >> /etc/default/puppet <<EOF
            START=yes
            EOF
            cat >> /puppet.conf <<EOF
            [agent]
          - server = seed.dmlc.pw
          + server = puppet
            EOF
            cp /puppet.conf /etc/puppet/puppet.conf
            echo "*/5 * * * * root puppet agent -t" >> /etc/crontab
          + echo "35.233.219.1 puppet" >> /etc/hosts
        EOT
      ~ name                    = "terraform-20200922194449451100000001" -> (known after apply)
      + name_prefix             = (known after apply)
      ~ project                 = "2036174436" -> (known after apply)
      + region                  = (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/beta/projects/heroic-muse-289316/global/instanceTemplates/terraform-20200922194449451100000001" -> (known after apply)
      - tags                    = [] -> null
      + tags_fingerprint        = (known after apply)

      ~ disk {
            auto_delete  = true
          ~ boot         = true -> (known after apply)
          ~ device_name  = "persistent-disk-0" -> (known after apply)
          - disk_size_gb = 0 -> null
          ~ disk_type    = "pd-standard" -> (known after apply)
          ~ interface    = "SCSI" -> (known after apply)
          - labels       = {} -> null
          ~ mode         = "READ_WRITE" -> (known after apply)
          ~ source_image = "projects/debian-cloud/global/images/family/debian-9" -> "debian-cloud/debian-9"
          ~ type         = "PERSISTENT" -> (known after apply)
        }

      ~ network_interface {
          + name               = (known after apply)
          ~ network            = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/networks/default" -> "default"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_target_pool.asg[0] will be destroyed
- resource "google_compute_target_pool" "asg" {
      - failover_ratio   = 0 -> null
      - health_checks    = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/global/httpHealthChecks/asg-health-check-europe-west6",
        ] -> null
      - id               = "projects/2036174436/regions/europe-west6/targetPools/asg-target-pool-europe-west6" -> null
      - instances        = [
          - "europe-west6-a/frontend-asg-euro-europe-west60-5h0j",
          - "europe-west6-a/frontend-asg-euro-europe-west60-x3wq",
        ] -> null
      - name             = "asg-target-pool-europe-west6" -> null
      - project          = "2036174436" -> null
      - region           = "europe-west6" -> null
      - self_link        = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/europe-west6/targetPools/asg-target-pool-europe-west6" -> null
      - session_affinity = "NONE" -> null
    }

  # google_dns_record_set.asg[0] will be destroyed
- resource "google_dns_record_set" "asg" {
      - id           = "dmlc/frontend-asg.europe-west6.dmlc.pw./A" -> null
      - managed_zone = "dmlc" -> null
      - name         = "frontend-asg.europe-west6.dmlc.pw." -> null
      - project      = "2036174436" -> null
      - rrdatas      = [
          - "34.65.169.148",
        ] -> null
      - ttl          = 300 -> null
      - type         = "A" -> null
    }

Plan: 1 to add, 0 to change, 8 to destroy.

Warning: Interpolation-only expressions are deprecated

  on main.tf line 55, in resource "google_dns_record_set" "asg_main":
  55:   name = "${var.dns_domain}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_euro_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Feuro)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_euro_autoscale`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
